app/controllers/albums_controller.rb

  def index
    @albums = @user.albums.includes(:photos).paginate(:page => params[:page], :per_page => 2)
---
SELECT `albums`.* FROM `albums` WHERE `albums`.`user_id` = 1
SELECT `photos`.* FROM `photos` WHERE `photos`.`album_id` = 8

  def create
  	@album = @user.albums.new(params[:album])

  	respond_to do |format|
  	  if @album.save
---
INSERT INTO `albums` (`created_at`, `description`, `title`, `updated_at`, `user_id`) VALUES ('2012-12-16 06:41:07', 'this is ', 'album1', '2012-12-16 06:41:07', 1)